// Дано:
// Три товари з категорії овочі:

// капуста = 8;
// авокадо = 30;
// помідор = 10;

// Три товари з категорії фрукти:

// виноград = 20;
// малина = 25;
// кокос = 50;

// Завдання: залежно від сезону, який вибирає користувач (зима чи літо), категорії (овочі чи фрукти), товару з вибраної категорії (овочі: капуста, авокадо, помідори чи фрукти: виноград, малина, кокос), і кількість вибраного товару – розрахувати кінцеву ціну та відобразити повну інформацію про вибраний товар у форматі HTML.

// Процедура:

// Запитайте у користувача сезон, коли він робить покупку: зима чи літо.
// Якщо користувач входить у зимовий період, кінцеву ціну слід помножити на 2
// Якщо користувач входить в літо, кінцева ціна повинна бути помножена на 0,8
// ВАЖЛИВО:
// Продовжуйте запитувати у користувача сезон, доки слово не буде введено правильно: «зима» або «літо».
// Введене значення може бути в будь-якому регістрі та з будь-якою кількістю пробілів перед/після/всередині слова.
// Запитайте у користувача категорію, з якої він зможе вибрати продукт на наступному кроці: овочі чи фрукти.
// ВАЖЛИВО:
// Продовжуйте запитувати категорію користувача, доки не буде введено правильне слово: «овочі» або «фрукти».
// Введене значення може бути в будь-якому регістрі та з будь-якою кількістю пробілів перед/після/всередині слова.
// Запитайте у користувача товар, який залежить від раніше обраної категорії.
// для овочів користувач може ввести: капусту, авокадо або помідор.
// для фруктів користувач може ввести: виноград, малину або кокос.
// ВАЖЛИВО:
// Продовжуйте запитувати у користувача товари, доки слово не буде введено правильним (одним із трьох типів).
// Введене значення може бути в будь-якому регістрі та з будь-якою кількістю пробілів перед/після/всередині слова.
// Запитати кількість продуктів, які були вибрані раніше.
// ВАЖЛИВО:
// Значення має бути більше 1.
// Вивести в html інформацію про закупівлю з кінцевою ціною. Наприклад:
// <div class="product" align="center">
//   <img src="images/vegetables/cabbage.svg" alt="капуста" width="100" height="100">
//   <p>Вибраний продукт: <b>капуста</b></p>
//   <p>Кількість капусти: <b>3</b></p>
//   <p>Вибраний період: <b>зима</b></p>
//   <p>Вибрана категорія: <b>овочі</b></p>
//   <p>Кінцева сума: <b>48 грн</b></p>
// </div>

// У додаткових матеріалах:

// Архів images.zip із зображеннями для кожного товару.
// render.png – приклад відображення покупки.
// Рендер карточки товара.pdf – приклад виконання завдання.

let cabbage = 8;
let avocado = 30;
let tomato = 10;
let grapes = 20;
let raspberry = 25;
let coconut = 50;

do {
  season = prompt('Введіть сезон (summer або winter):').replaceAll(' ', '').toLowerCase();
} while (season !== "summer" && season !== "winter");

do {
  category = prompt('Введіть категорію (vegetables або fruits):').replaceAll(' ', '').toLowerCase();
} while (category !== 'vegetables' && category !== 'fruits');

productOptions = (category === 'vegetables') ? ['cabbage', 'avocado', 'tomato'] : ['grapes', 'raspberry', 'coconut'];
do {
  product = prompt(`Введіть продукт (${productOptions.join(', ')}):`).replaceAll(' ', '').toLowerCase();
} while (productOptions.indexOf(product) === -1);

do {
  count = parseInt(prompt("Введіть кількість продукту (не менше 1):"));
} while (isNaN(count) || count < 1);

switch (product) {
  case "cabbage":
    finalPrice = cabbage * count;
    break;
  case "avocado":
    finalPrice = avocado * count;
    break;
  case "tomato":
    finalPrice = tomato * count;
    break;
  case "grapes":
    finalPrice = grapes * count;
    break;
  case "raspberry":
    finalPrice = raspberry * count;
    break;
  case "coconut":
    finalPrice = coconut * count;
    break;
}

if (season === "summer") {
  finalPrice *= 0.8;
} else {
  finalPrice *= 2;
}

document.write(`
<div class="product" align="center">
  <img src="images/${product}.svg" alt="${product}" width="100" height="100">
  <p>Selected product: <b>${product}</b></p>
  <p>Count of ${product}: <b>${count}</b></p>
  <p>Selected period: <b>${season}</b></p>
  <p>Selected category: <b>${category}</b></p>
  <p>Final sum: <b>${finalPrice} UAH</b></p>
</div>
`);